<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"2a26df33b75b9d608e39d596d499bd01fadbe7261bb94bd32ced3c70dca9e38e","plan_job_ref":"Job Terraform Plan #5 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10337484535","plan_out_hash":"3360d3a617ac49ec4ec59780e83f434ccac30b0d7268fda561584ca8d01157d7","plan_hash":"9c6fe0a9d0bf4eed5f08b716ca0dbffb78bd77336e2baaaa811c8b86e75cf2ae","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__<details open><summary>With variables</summary>

```hcl
bucket_name     = "ghactions-test-25be4e6576027f2c915ab17f47bc637527618957"
repository_name = "ghactions-test-25be4e6576027f2c915ab17f47bc637527618957"
```
</details>
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.bucket.aws_s3_access_point.access_point will be created
+   resource "aws_s3_access_point" "access_point" {
+       account_id               = (known after apply)
+       alias                    = (known after apply)
+       arn                      = (known after apply)
+       bucket                   = (known after apply)
+       bucket_account_id        = (known after apply)
+       domain_name              = (known after apply)
+       endpoints                = (known after apply)
+       has_public_access_policy = (known after apply)
+       id                       = (known after apply)
+       name                     = "ileriaccesspoint"
+       network_origin           = (known after apply)
+       policy                   = (known after apply)

+       vpc_configuration {
+           vpc_id = "*********************"
        }
    }

  # module.bucket.aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "ghactions-test-25be4e6576027f2c915ab17f47bc637527618957"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.bucket.aws_s3_bucket_ownership_controls.ownership_controls will be created
+   resource "aws_s3_bucket_ownership_controls" "ownership_controls" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.bucket.aws_s3_bucket_public_access_block.public_access will be created
+   resource "aws_s3_bucket_public_access_block" "public_access" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.bucket.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "aws:kms"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.ecr.aws_ecr_repository.repository will be created
+   resource "aws_ecr_repository" "repository" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "ghactions-test-25be4e6576027f2c915ab17f47bc637527618957"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all             = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #5](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10337484535)